{
  "date": "2021-07-21T11:04:39.581Z",
  "title": "Blocking adverts with Ad-Guard across your network",
  "tags": [
    "home-network"
  ],
  "excerpt": "Network-wide advert blocking with Ad-Guard",
  "body": "I run an Unraid server at home. This serves as my NAS, but also as my server for all sorts of docker containers. One of those is Ad-Guard Home, an advert and tracker blocker.\n\nYou can get browser extensions from Ad Guard, but this will only work on the browser that it's installed on, which for a multi-device network isn't great.\n\nInstalling Ad-guard via Unraid is simple with the Community Applications plugin:\n\n1. Click the 'Apps' toolbar link in the top navigation, and search for \"Adguard home\"\n2. Click on the Download icon to install it\n\n   ![Adguard](/img/blogheaders/adguardhome1.png \"Adguard\")\n3. Click back onto the Docker tab, and find your container\n4. Click on the icon, and select \"Edit\" from the context menu.\n5. Select the network type to be \"br0\"\n6. Give a fixed IP address that isn't in use on your network\n\n   ![adguard](/img/blogheaders/adguardhome2.png \"adguard\")\n7. Click \"Apply\"\n\nYou should now be able to navigate to that IP address in your browser, and open AdGuard.\n\n\n\nNow that we have AdGuard installed, we need to modify where our internet traffic goes to, to pass through this. \n\nYou \\_could\\_ modify each computer on your network to change the DNS address to that of the Ad-Guard server to accomplish this. However, depending on how many devices you have, this could be a lengthy process. Also, devices like mobiles or tablets may not allow you to change the DNS address.\n\nI changed the DNS in my router to that of my AdGuard IP address. (There is a guide  inside of Adguard for further information on how to achieve this if you require)\n\n![adguard](/img/blogheaders/adguardhome3.png \"adguard\")\n\nI logged into my router, and selected the \"Basic Network\" tab. Your router setup may be different to mine, as I am running the FreshTomato custom firmware on my router.\\\n\\\nChange the \n\n```\nDNS Server\n```\n\nto \n\n```\nManual\n```\n\nand then enter the IP Address of your Adguard installation as \n\n```\nDNS 1\n```\n\n(I also put one of the Google DNS servers as my secondary, in case anything went wrong, and my Adguard stopped working.\n\n![adguard](/img/blogheaders/adguardhome4.png \"adguard\")\n\nClick Save, and you should be good to go!\n\nBrowse a few sites, and within a few minutes, you should see some data being collected in AdGuard.\n\n![](/img/blogheaders/adguardhome5.png)\n\nThis should set you in good stead for any futher enhancements you may wish to do!"
}