{
  "date": "2020-06-13T23:00:00.000Z",
  "title": "Home Automation with Home Assistant",
  "excerpt": "Tinkering with Home Assistant for all things Home Automation",
  "body": "A few months ago. I was bitten by the Home Automation bug. This started with a simple conversation with a colleague about security cameras. He mentioned some software called [Home Assistant](https://www.home-assistant.io/), which is an open-source piece of software that allows you to automate all sorts of things in your home.\n\nThis began with researching what was possible, and what I could do. I wanted to start simple, just to get a feel of things. Inevitably, this started with automating lights (I think this is where most people start!). I found that Ikea do [starter kits](https://www.ikea.com/gb/en/p/tradfri-gateway-kit-colour-and-white-spectrum-10406877/) for a reasonable price. Perfect!\n\nThis kit came with a couple of light bulbs, a remote, and the hub required to communicate with the bulbs. This was up and running in no time at all, and I was very happy with it... to start with.\n\n![](/img/tradfrikit.png)\n\n### Fine Control\n\nI wanted to do more.. I wanted to be able to turn on the lights when I walked into the room, for instance. Handily, Ikea also sell some motion sensors. As these are part of the same range as the lights, they already integrate nicely with them. So, I purchased a couple of these as well. Again, connected up and working in no time.\n\nI still wanted more. More control over what items did what. Enter Home Assistant.\\\nI run an Unraid server at home, for all my NAS needs. This also allows you to expand functionality, by running [Docker](https://www.docker.com/) containers. As it turns out, there is also a docker container for Home Assistant.\n\nFast-forward a couple of weeks, and I'd got HA up and running, and I'd tinkered enough with it to know what I wanted to do.\n\nI then hit a snag. It turns out that the Ikea hub doesn't let you connect it to HA. The hub runs the Zigbee interface for low-powered devices, but doesn't expose itself be being controlled externally. \n\nA few posts on the home assistant forums suggested using a universal zigbee gateway. The [Conbee II](https://phoscon.de/en/conbee2), A small usb-key that runs as a hub, but with much more control over what you want to do with it. (Also, works with HA, if you hadn't guessed!)\n\nSo, I purchased https://phoscon.de/en/conbee2one of these and installed the software for this (Also a docker container) on my server.\n\nWe're up and running! - Time to disband the Ikea hub, and move over to Conbee.\n\n### Even Finer control\n\nHome Assistant does most of what I was aiming for, but the techy in me wanted to see what else I could do. [Node RED](https://nodered.org/) is a node-based application for wiring together different hardware devices.\n\nInstall that on the server (also as a Docker container). So at this point, I have Home Assistant, DeConz (the Conbee software) and Node RED all installed via docker on the server.\n\nHooking into Home Assistant is easy, and once connected, you have access to all of HA's devices.\n\nFrom here, I can tweak, change and customise how I want things to work.\n\nFor example, I have a motion sensor in my hallway, and an Ikea light on the landing upstairs.\n\nI listen for the motion sensor trigger, and tell it to turn on the upstairs landing light. After 5 minutes, I tell the light to turn off.\n\n![](/img/nodered1.png)\n\nNow that I have such fine control, the possibilities are endless!\n\nUpdate: I've now added a few door/window sensors into the fray. Whenever a sensor goes off, it sends a message to my phone letting me know.",
  "tags": [
    "home-network",
    "home-assistant"
  ],
  "headerimg": "/img/blogheaders/homeassistant.png"
}