{
  "date": "2012-11-25T00:00:00.000Z",
  "title": "More Pi adventures - streaming videos",
  "body": "So, in my previous post, I showed how to get XBMC media center installed onto the SD Card for your Raspberry Pi.\\\n\\\nNow comes my thoughts, after using it for a short while.\n\n### Non-x264 encoded files\n\nI only have xvid-encoded video files to test with, so i'm not sure how other encoded files will perform.\\\nStreaming xvid-encoded files over the network provided rather pleasing results.. for the most part, I can play these files just fine.\\\n\\\nI did have a couple of files that would buffer every few seconds, effectivly making watching the show impossible. However, I couldn't be sure if it was a) an issue with the Pi, b) an issue with that particular file, or c) network-related issues. - more investigation is required at a later date.\\\n\\\nGenerally speaking, playing xvid files is nigh on perfect.\\\n\\\n*Verdict*: Awesome!\n\n### x264 encoded files\n\nSo onto x264 encoded files. If the file has been encoded with the x264 codec, then the Pi can use its hardware-accelerated GPU to do all of the decoding (which is good), leaving the rather weak CPU to do other things. I have a few different files that have been encoded this way, namely:\n\n* 256-400mb TV shows (contained within the Matroska format)\n* 5-8GB bluray rips (again, contained within the Matroska format)\n* 15-40GB .m2ts files, ripped straight from a bluray disc.\n\nThe TV Show files all played without issue, with hardly a burp from the Pi. So far so good!\\\n\\\nThe bluray rips also played without issue, which was a suprise. I was expecting these to either fall over, or start buffering left,right and center.. but no, they were all good.\\\n\\\nThe only issue comes with the full-fat Mpeg streams taken directly off a bluray disc, with no re-coding or converting. My other HTPC plays these fine over a wired network.. wireless is a different matter (but thats for another post).\\\nMost, if not all exhibited some form of stuttering, showing itself as buffering every few seconds. Now, at this point I'm not sure if its network related issues, or the Pi just can't cope with the rather large bit-rates found in these epicly big files.\\\nAt some point, i'm going to try copying a file to the SD Card, and running from there, to see what happens.\\\n\\\n*Verdict*: For the most part, Awesome! - .m2ts files don't work too well, but I wasn't expecting it all to work on such a low powered device.",
  "excerpt": "More Pi adventures - streaming videos",
  "tags": [
    "home-network"
  ]
}