{
  "date": "2015-11-25T00:00:00.000Z",
  "title": "More Pi Adventures - Icing on the cake",
  "body": "<!--StartFragment-->\n\n### Navigating the XBMC menus\n\nSo by now, I have Raspbmc installed and working, and hopefully know the limits on what it can and cannot play. Now to customise/configure the xbmc install to how I want it (to match other installations on xbmc that I have through the house).\\\n\\\nOne thing that was bugging me, was the fact I needed to have a keyboard attached to actually use it. That in itself is no big deal, but im currently using the RaspPi in the bedroom, and having to use a keyboard whilst in bed gets to be a chore after a while.\\\n\\\nSo, I began to investigate what 3rd party remote controls I could purchase to use in it place. Remotes like the Harmony's apparently work great, but I don't have one, and I don't really want to spend £70+ on a remote control - even if it can control upto 15 devices.. as I say, im using this in the bedroom, so I've only got the Pi, amp, and TV.. seems a little overkill to me.\\\n\\\nThat's when I discovered that the latest version of Raspbmc also includes [HDMI-CEC](http://en.wikipedia.org/wiki/HDMI#CEC) (Consumer Electronics Control). This essentially means that you can control multiple devices connected via HDMI with ONE remote control. I'd heard of CEC before, back when XBMC announced a year or so ago, that it was supporting CEC via an external 3rd-party attachment. Now, as it turns out, the R-Pi can also function as a CEC client out of the box, and the Raspbmc flavor of xbmc has support for CEC built-in.\\\n\\\nMost of you with newer flat-screen TV's may already have CEC-enabled sets, the different manufactures call it by different names, **Sony**, for example call it 'Bravialink', and **Samsung** calls it 'Anynet+'\\\n\\\nThe TV that the Pi is attached to is a Toshiba, which has its own version, called 'Regza-Link'. On the remote control for the tv, there is a switch to turn it to 'Regza-link'. so, flicking the switch, I started pressing buttongs to see what would happen. Low and behold, things started to happen!\\\n\\\nFlicking to Regza-link, I can use the D-Pad, and center button to control the Pi - No need to purchase and use another remote control, I can simply use my existing TV remote control to navigate the XBMC menus! now *that* is cool!\n\n### XBMC Plug-ins\n\nOn previous installs of XBMC, I've installed the BBC iPlayer add-on, and had some (mostly good) success with it. I can browse all of the iPlayer content, and stream directly onto the TV without having to hook up another machine with a web-browser to access the content.\\\n\\\nI came across a blog post on [djb31st.co.uk](http://djb31st.co.uk/blog/catch-up-tv-on-raspberry-pi-raspbmc-bbc-iplayer/), that detailed what you need to do/install to get it up and running.\\\n\\\nFollowing these step-by-step instructions, I had the BBC iPlayer, ITV Player, 4od and Demand 5 catchup services running in no time, with no issues!\\\n\\\nAnd, by using the HDMI-CEC above, I have effectivley got one of the newer swanky 'Smart-TVs', with just a £25 computer.\n\n<!--EndFragment-->",
  "excerpt": "More Pi Adventures - Icing on the cake",
  "tags": [
    "home-network"
  ]
}