{
  "date": "2012-08-11T23:00:00.000Z",
  "title": "PHP + MSSSQL issues",
  "body": "## PHP + MSSQL unicode issues...\n\nLast night, I was tinkering with using MSSQL with PHP.\\\nAll was going great.. created my database tables, created the stored procedures that were required for the project etc.\\\n\\\nNow, the time to test out these stored procs was here. Slap a little php code together to connect to the database, and execute the stored procedure, when I was greeted with the following error message:\n\n```\nWarning: mssql_execute(): message: Unicode data in a Unicode-only collation or ntext data cannot be sent to clients using DB-Library (such as ISQL) or ODBC version 3.7 or earlier. (severity 16)  \n```\n\nWell.. this wasnt what I expected to see!\\\n\\\nA bit of googling later, and the overwhelming suggestion was to cast my NTEXT fields as TEXT.\\\nThere's just one problem with this. None of my fields were NTEXT. (They were all NVARCHAR)\\\n\\\nI gave it a whirl, modified my stored procs to cast to text, and retried. And the same error.Back to the drawing board. (in this case, more Googling).\\\n\\\nA few more posts read later, FreeTDS 4.2 doesnt support unicode data. V8.0 does. So, lets change the version. Edit your freetds.conf file.. mine was located in\n\n```\n/etc/freetds.conf  \n```\n\nI SFTP'ed the file down to my machine, and opened in text editor.\\\n\\\nMine looked a little like this:\n\n```\n #  $Id: freetds.conf,v 1.12 2007/12/25 06:02:36 jklowden Exp $  \n #  \n # This file is installed by FreeTDS if no file by the same   \n # name is found in the installation directory.   \n #  \n # For information about the layout of this file and its settings,   \n # see the freetds.conf manpage \"man freetds.conf\".   \n # Global settings are overridden by those in a database  \n # server specific section  \n [global]  \n     # TDS protocol version  \n ;     tds version = 4.2  \n```\n\nAh-ha! 4.2! - lets change that bad boy to 8.0.\n\n```\n ;     tds version = 8.0  \n```\n\nRe-upload, and refresh my page...\\\n..\\\n..\\\nAnd, still the same.\\\n\\\nThats when I noticed the semi-colon at the start. Now, me not being particularly up on linux, or tinkering with linux config files, I wasnt sure what the semi-colon meant.\\\nAs things turn out, its a comment.. so all text after it is ignored. I knew that hashes (#) were comments, but didnt know about semi-colons. So what's the difference? Comments starting with # are a proper comment, and those starting with a ; character, indicate that this is a default value for an attribute.\\\n\\\nAh-ha! so, this is saying that the default value for the 'tds version' is 4.2.. I don't want to set a comment to show its default value, I want to set it.. simply remove the semi-colon, save, and re-upload.\n\n```\n #  $Id: freetds.conf,v 1.12 2007/12/25 06:02:36 jklowden Exp $  \n #  \n # This file is installed by FreeTDS if no file by the same   \n # name is found in the installation directory.   \n #  \n # For information about the layout of this file and its settings,   \n # see the freetds.conf manpage \"man freetds.conf\".   \n # Global settings are overridden by those in a database  \n # server specific section  \n [global]  \n     # TDS protocol version  \n      tds version = 8.0  \n```\n\nRefresh your page, and BINGO! proper text coming through from your stored procs :)",
  "tags": [
    "aws"
  ],
  "excerpt": "PHP + MSSSQL issues"
}