{
  "date": "2012-11-25T00:00:00.000Z",
  "title": "Rich's adventures with the Raspberry Pi",
  "body": "For the un-initiated, the [Raspberry Pi](http://www.raspberrypi.org/) is a small, credit-card sized computer designed for low-cost entry for children/students to get the ball rolling with computer programming.\\\n\\\nThe Raspberry Pi contains:\n\n* HDMI socket\n* RJ45 (Ethernet) port\n* Micro-USB socket\n* Composite video output\n* 2x USB sockets\n* SD card socket\n* 256MB Ram (newer models now contain 512MB)\n* 700Mhz CPU\n* 3.5mm Headphone jack for audio-out\n\n![](/img/raspberrypi.jpg)\n\nThe best thing about the Pi, is that it also contains a hardware-accellerated GPU, so that the playing of x264-encoded video files will play absolutly fine (even 1080p ones!)\\\n\\\nWith no internal storage, all software is installed and executed from the SD card, so a card of at least 4GB is recommended.\n\n### XBMC\n\nThis leads me on to the reason I purchased one. A small, cheap, media center.\\\nIt was never my intention to start coding on it (I do enough coding as it is, as part of my day job ;)\\\nIf you've not come across [XBMC](http://www.xbmc.org/) before, then its well worth a look. XBMC is an open-sourced media center application that has installers for Windows, Mac, iOS (iPhone, iPad, Apple TV/Apple TV2), Linux, and now, ARM-based processors.\\\n\\\nI've been using XBMC for years, ever since it first started on the original Xbox 1, way back when it was called 'Xbox Media Player'. The original Xbox has now been dropped, but losing a 10+ year old console has enabled them to branch out, and add more and more features.\n\n#### Installing XBMC\n\nDoing a little research beforehand, I discovered [Raspbmc](http://www.raspbmc.com/), a small Debian-based linux package that has most of the the un-needed elements removed, and the XBMC code added.\\\n\\\nInstalling XBMC to the SD Card is simple enough.. download the installer from the [download section](http://www.raspbmc.com/download/) of Raspbmc. Once downloaded, just run the installer. (if your installing from windows, and you have UAC active, then you should run it as Administrator)\\\n\\\nExecute the installer, and you should end up with a screen like below:\\\n\\\n![http://www.raspbmc.com/wp-content/uploads/2012/06/rwin32.png](http://www.raspbmc.com/wp-content/uploads/2012/06/rwin32.png)\\\n\\\nYour SD card should be the only item displayed on the list, so go ahead and select it, and hit 'Install'.\\\n\\\nThis will download the installer files, and create a bootable image directly on the SD Card.\\\nOnce this is done, bop over to your Pi, pop in the SD Card, and boot up.\\\n\\\nOne thing to note, is that a network connection is required for this install, so make sure that your network cable is plugged in prior to powering on.\\\n\\\nThe installer should then start running. What it does here, is connect to the Raspbmc site and download the latest version of XBMC (which at the time of writing, is v12 \\[frodo] beta).\\\n\\\nThis will take a few minutes, so like the installer says, go grab a coffee ;)\\\n\\\nJust leave it to do its thing, and all being well, when you return XBMC will be all correctly installed and ready to go.\\\n\\\nSimples!",
  "tags": [
    "home-network"
  ],
  "excerpt": "Rich's adventures with the Raspberry Pi"
}