{
  "date": "2019-08-07T11:59:00.133Z",
  "title": "Virtual DJ",
  "excerpt": "A Virtual Machine, running on Unraid, that runs VirtualDJ with hardware pass-through",
  "body": "I've been interested in DJ'ing since I was about 16. I purchased a cheap set of belt-drive turntables and a mixer, and haven't looked back since. I'm not very good, but that's not the point ;)\n\nWhen DJ CD players were all the rage, I really wanted a pair, but they were expensive, and I didn't want to have to re-burn all of my vinyl to cds.\n\nA few years later, I found some cheap-ish CD players that also played MP3's.\\\nCrucially, these players were also a controller - meaning you could hook them up to a computer, and use software to control them.\n\nI repurposed an old laptop I had, installed VirtualDJ and hooked everything up.\\\nThis was a game-changer for me.. not only could I have all my music as MP3's, and have them stored on the laptop (and not burned to CDs), but it also meant I could invest in some Time-Coded vinyl - These are special 12\" records that connect to an external box, that converts the high-pitched tones on the record (you really don't want to play those through a regular set-up!) into the MP3 you have playing on the virtual deck. You can mix/scratch on real vinyl, but you are actually playing an mp3 on the computer. it's some sort of technical wizardry.\n\nThe problem was the laptop. It was old, and prone to crashing. I needed to rethink.\n\n### Unraid\n\nUnraid, whilst primarily a NAS, also lets you run docker containers, and virtual machines. a big plus for this is the ability to pass through hardware on the main computer through to the virtual machine. You can do crazy things such as [7 gamers, one CPU](https://www.youtube.com/watch?v=LXOaCkbt4lI)..\n\nI created a Windows 10 Virtual Machine, installed VirtualDJ on that, and hooked all my cd players etc to my server. I then passed through those hardware elements to the virtual machine. It's like I have a separate machine with no discernible slow-down or performance penalty\n\n![](/img/decks.jpg)",
  "tags": [
    "home-network"
  ]
}